{"articles":[{"Id":"0","Title":"REST","Author":"Boris","Subject":"S960228","desc":"Representational state transfer (REST)","content":"Representational state transfer (REST) is a software architectural style which uses a subset of HTTP. It is commonly used to create interactive applications that use Web services. A Web service that follows these guidelines is called RESTful. Such a Web service must provide its Web resources in a textual representation and allow them to be read and modified with a stateless protocol and a predefined set of operations. This approach allows interoperability between the computer systems on the Internet that provide these services. REST is an alternative to, for example, SOAP as way to access a Web service."},{"Id":"1","Title":"OAuth 2.0","Author":"Saverio","Subject":"S960483","desc":"Industry-standard protocol for authorization","content":"OAuth 2.0 focuses on client developer simplicity while providing specific authorization flows for web applications, desktop applications, mobile phones, and living room devices. This specification and its extensions are being developed within the IETF OAuth Working Group."},{"Id":"2","Title":"Remote attestation","Author":"Boris","Subject":"S960228","desc":"Remote attestation is a method by which a host (client) authenticates it’s hardware and software configuration  to  a  remote  host  (server).","content":"The  goal  of  remote  attestation  is  to  enable  a  remote system  (challenger)  to  determine  the  level  of  trust  in  the  integrity  of  platform  of  another  system (attestator).  The  architecture  for  remote  attestation  consists  of  two  major  components:  Integrity measurement architecture and remote attestation protocol.The  remote  attestation  protocol  proposed  by  IBM  [3]  is  vulnerable  to  Man-In-The-Middle  attack. We propose a modified version of the protocol that is  secure. We have implemented a model of our proposed protocol on Murphi [7] to analyse the security properties of the protocol. This report describes  the  design  of  our  protocol  and  it’s  analysis  using  Murphi.  We  conclude  that  our proposed  protocol  is  secure  under  certain  assumptions  of  trust  and  can  be  used  for  remote attestation."},{"Id":"3","Title":"Articolo Esempio","Author":"Saverio","Subject":"S960483","desc":"DEscrizone","content":"dasds"},{"Id":"4","Title":"Esempio articolo","Author":"Boris","Subject":"S960228","desc":"dasdas","content":"dadsda"},{"Id":"5","Title":"Questo [ un esempio","Author":"Boris","Subject":"S960228","desc":"dsada","content":"dsada"},{"Id":"6","Title":"Esempio 5 ","Author":"Boris","Subject":"S960228","desc":"dsadsadas","content":"dsdasd"}]}